app/controllers/polygons_controller.rb

SELECT "polygons".* FROM "polygons"
---
  def index
    @polygons = Polygon.all

INSERT INTO "polygons" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Powai"], ["created_at", "2015-07-27 10:50:15.731761"], ["updated_at", "2015-07-27 10:50:15.731761"]]
---
  def create
    @polygon = Polygon.new(polygon_params)

    respond_to do |format|
      if @polygon.save

SELECT  "polygons".* FROM "polygons" WHERE "polygons"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_polygon
      @polygon = Polygon.find(params[:id])